Bwooce/tinygs_nRF52/src/main.cpp
                    LOG_INF("  → %s %.4fMHz SF%d BW%.1f%s%s",
                            tinygs_radio.satellite,
                            (double)tinygs_radio.frequency,
                            tinygs_radio.sf,
                            (double)tinygs_radio.bw,
                            tinygs_radio.tle_valid ? " TLE" : "",
                            tinygs_radio.filter[0] ? " FLT" : "");
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    tinygs_radio.frequency = freq;
                    radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz (foff=%.0f Hz)",
                            (double)freq, (double)tinygs_radio.freq_offset);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is JSON string with sat name */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        LOG_INF("  → satellite: %s", tinygs_radio.satellite);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                /* Rename station: ["MAC", "new_name"]
                 * Only apply if MAC matches our device. Needs NVS to persist. */
                extern char device_client_id[13];
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) == 12) {
                        char mac[13];
                        memcpy(mac, p + 1, 12);
                        mac[12] = '\0';
                        if (strcmp(mac, device_client_id) == 0) {
                            p = strchr(end + 1, '"');
                            if (p) {
                                end = strchr(p + 1, '"');
                                if (end) {
                                    size_t nlen = end - p - 1;
                                    if (nlen > 0 && nlen < sizeof(cfg_station)) {
                                        memcpy(cfg_station, p + 1, nlen);
                                        cfg_station[nlen] = '\0';
                                        tinygs_config_save_station(cfg_station);
                                        LOG_INF("  → Renamed to: %s (saved, rebooting)", cfg_station);
                                        k_msleep(500);
                                        sys_reboot(SYS_REBOOT_COLD);
                                    }
                                }
                            }
                        } else {
                            LOG_DBG("  → set_name: MAC mismatch");
                        }
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("  → Reset requested by server");
                k_msleep(500);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                LOG_INF("  → TX not supported (tx=false)");
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                LOG_INF("  → Sleep requested (not implemented yet)");
            } else if (strcmp(cmnd, "foff") == 0) {
                /* Frequency offset in Hz — applied on next begine freq set */
                float foff = strtof((char *)rx_payload, NULL);
                tinygs_radio.freq_offset = foff;
                /* Apply immediately if radio is active */
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → foff=%.0f Hz", (double)foff);
            } else if (strcmp(cmnd, "filter") == 0) {
                /* Packet filter — JSON array of bytes to match in received packets.
                 * Packets not matching the filter are silently dropped. */
                const char *p = strchr((char *)rx_payload, '[');
                if (p) {
                    p++;
                    tinygs_radio.filter_len = 0;
                    while (*p && *p != ']' && tinygs_radio.filter_len < sizeof(tinygs_radio.filter)) {
                        while (*p == ' ' || *p == ',') p++;
                        if (*p == ']') break;
                        tinygs_radio.filter[tinygs_radio.filter_len++] = (uint8_t)atoi(p);
                        while (*p && *p != ',' && *p != ']') p++;
                    }
                }
                LOG_INF("  → filter: %d bytes", tinygs_radio.filter_len);
            } else if (strcmp(cmnd, "update") == 0) {
                LOG_INF("  → OTA update not supported (UF2 bootloader)");
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else if (strcmp(cmnd, "sat_pos_oled") == 0) {
                /* Satellite position for world map display: [x, y] pixel coordinates */
                LOG_DBG("  → sat_pos_oled: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "frame") == 0 ||
                       strncmp(cmnd, "frame/", 6) == 0) {
                LOG_DBG("  → frame data (display not implemented)");
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

